#include "beep.h"

#include "systick.h"
u8  fac_us=0;							//us延时倍乘数	

//void delay_us(u32 nus)
//{		
//	u32 temp;	    	 
//	SysTick->LOAD=nus*fac_us; 					//时间加载	  		 
//	SysTick->VAL=0x00;        					//清空计数器
//	SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;	//开始倒数	  
//	do
//	{
//		temp=SysTick->CTRL;
//	}while((temp&0x01)&&!(temp&(1<<16)));		//等待时间到达   
//	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;	//关闭计数器
//	SysTick->VAL =0X00;      					 //清空计数器	 
//}


void Sound(u16 frq)
{
	u32 time;
	if(frq != 1000)
	{
		time = 500000/((u32)frq);		//频率的倒数即是时间，然后此处计算的是T/2的时间，所以为500000
		TIM2->CR1 |= TIM_CR1_CEN;
		delay_us(time);
		TIM2->CR1 &= (uint16_t)(~((uint16_t)TIM_CR1_CEN));
		delay_us(time);
	}else
		delay_us(1000);
}

 

void play(void)
{

         //             掅7  1   2   3   4   5   6   7  崅1 崅2 崅3 崅4 崅5 晄?壒

         uc16 tone[] = {247,262,294,330,349,392,440,494,523,587,659,698,784,1000};//壒?悢悩昞

         //??忣壧

         u8 music[]={       5,5,6,8,7,6,5,6,13,13,//壒?

                                                                           5,5,6,8,7,6,5,3,13,13,

                                                                   2,2,3,5,3,5,6,3,2,1,

                                                                           6,6,5,6,5,3,6,5,13,13,

 

                                                                           5,5,6,8,7,6,5,6,13,13,

                                                                           5,5,6,8,7,6,5,3,13,13,

                                                                   2,2,3,5,3,5,6,3,2,1,

                                                                           6,6,5,6,5,3,6,1,   

 

                                                                           13,8,9,10,10,9,8,10,9,8,6,

                                                                           13,6,8,9,9,8,6,9,8,6,5,

                                                                           13,2,3,5,5,3,5,5,6,8,7,6,

                                                                           6,10,9,9,8,6,5,6,8

         };     

         u8 time[] = {       2,4,2,2,2,2,2,8,4, 4, //??

                                                                           2,4,2,2,2,2,2,8,4, 4,

                                                                           2,4,2,4,2,2,4,2,2,8,

                                                                           2,4,2,2,2,2,2,8,4 ,4,

        

                                                                           2,4,2,2,2,2,2,8,4, 4,

                                                                           2,4,2,2,2,2,2,8,4, 4,

                                                                           2,4,2,4,2,2,4,2,2,8,

                                                                           2,4,2,2,2,2,2,8,

        

                                                                           4, 2,2,2, 4, 2,2,2, 2,2,8,

                                                                           4, 2,2,2,4,2,2,2,2,2,8,

                                                                           4, 2,2,2,4,2,2,5,2,6,2,4,

                                                                           2,2 ,2,4,2,4,2,2,12

         };     

         u32 yanshi;

         u16 i,e;

         yanshi = 10;

         for(i=0;i<sizeof(music)/sizeof(music[0]);i++){

                   for(e=0;e<((u16)time[i])*tone[music[i]]/yanshi;e++){

                            Sound((u32)tone[music[i]]);

                   }      

         }

}
